# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

x = int(input('Введите число: '))
kount = 0
number = 0
while x != 0:
    x1 = int(x % 2)
    x = int(x / 2)
    number += x1 * 10 ** kount
    kount += 1
print(number)